_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 31, 31, 32)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 30752)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               3936384   
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 129       
=================================================================
Total params: 3,937,409
Trainable params: 3,937,409
Non-trainable params: 0
_________________________________________________________________